thomsardi/stm32-lvd/src/main.cpp
#include <Arduino.h>
#include <CANController.h>
#include <STM32FreeRTOS.h>
#include <Beastdevices_INA3221.h>
#include <DataDef.h>
#include <BatteryProcessing.h>
#include <EEPROM.h>
#include <Pack.h>

#define ON1 PA5 //  Vsat
#define ON2 PA6 //  BTS
#define ON3 PA7 //  Other
#define OFF1 PB0  //  Vsat
#define OFF2 PB1  //  BTS
#define OFF3 PB10 //  Other

/**
 * Pin remap
*/
#define VSAT_ON PA7
#define VSAT_OFF  PB10
#define BTS_ON  PA6
#define BTS_OFF PB1
#define OTHER_ON  PA5
#define OTHER_OFF PB0

#define FB1 PB14  //  Vsat
#define FB2 PB13  //  BTS
#define FB3 PB12  //  Other

#define LVD_LOW_VSAT_ADDR 0
#define LVD_LOW_OTHER_ADDR 4
#define LVD_LOW_BTS_ADDR 8
#define LVD_RECONNECT_VSAT_ADDR 12
#define LVD_RECONNECT_OTHER_ADDR  16
#define LVD_RECONNECT_BTS_ADDR  20
#define LVD_TOLERANCE_ADDR 24
#define NOMINAL_BAT_ADDR 28
#define UNIQUE_ID_ADDR 32
#define FLAG_SET_ADDR 36

#define idCanbusEnergyMeter 0x1D40C8E7

CANController can;
Beastdevices_INA3221 ina3221b(INA3221_ADDR40_GND);
BatteryProcessing batProc;
AdditionalCANData additionalCanData;
AlarmParameter voltageAlarm = {4600, 4600, 4700, 4700, 4700, 4800};
TaskHandle_t relayTaskHandle;
TaskHandle_t canSenderTaskHandle;
// TaskHandle_t ina3221TaskHandle;

SemaphoreHandle_t myLock = xSemaphoreCreateMutex();

// QueueHandle_t relayTaskQueue;
QueueHandle_t canSenderTaskQueue;

uint32_t count;
uint32_t count2;
uint16_t uniqueId = 160;
uint8_t lostConnectionCounter = 0;
bool isOverriden;
unsigned long lastTime = 0;
unsigned long lastCheckTime = 0;

BatteryData batteryData[24];
size_t batterySize = sizeof(batteryData) / sizeof(batteryData[0]);

BatteryData dummyData[24];
Pack packData(dummyData, 24, 0);

EhubRelayWrite ehubRelay;
KeepAliveCounter keepAliveCounter;
bool isDataReady = false;
// put function declarations here:

void testCan(CAN_msg_t msg)
{
  Serial1.println("can handler block");
}

void canHandler(CAN_msg_t msg)
{
  uint32_t frameId = msg.id;
  HalfPackData halfPackData;
  HalfMosfetData halfMosfetData;
  int length = msg.len;
  int index = 0;
  int baseAddr = 0;
  // Serial1.print("Frame Addr : ");
  // Serial1.println(frameId, HEX);
  // return;
  // Serial1.println((frameId & 0xFFFFFFC0), HEX);
  switch (frameId & 0xFFFFFFC0)
  {
  case PACK_DATA:
    baseAddr = static_cast<int>(PACK_ADDR);
    index = baseAddr - frameId;
    // Serial1.println("Index : " + String(index));
    // return;
    // index = abs(index);
    // Serial1.println("index : " + String(index));
    // for (size_t i = 0; i < length; i++)
    // {
    //   Serial1.print(msg.data[i], HEX);
    //   Serial1.print(" ");
    // }
    halfPackData.id = index;
    halfPackData.isUpdated = 1;
    halfPackData.packVoltage = batProc.getPackVoltage(msg, 2, 2);
    halfPackData.packCurrent = batProc.getPackCurrent(msg, 4, 2);
    halfPackData.packSoc = batProc.getPackSoc(msg, 6, 2);
    packData.insert(halfPackData);
    isDataReady = true;
    // batteryData[index - 1].id = index;
    // batteryData[index - 1].isUpdated = 1;
    // batteryData[index - 1].packVoltage = batProc.getPackVoltage(msg, 2, 2);
    // batteryData[index - 1].packCurrent = batProc.getPackCurrent(msg, 4, 2);
    // batteryData[index - 1].packSoc = batProc.getPackSoc(msg, 6, 2);
    // batteryData[index - 1].incPackCounter();
    // Serial1.println("Id : " + String(index));
    // Serial1.println("Pack Voltage : " + String(batteryData[index - 1].packVoltage));
    // Serial1.println("Pack Current : " + String(batteryData[index - 1].packCurrent));
    // Serial1.println("Pack Soc : " + String(batteryData[index - 1].packSoc));
    // return;
    break;
  case MOSF_TEMP :
    baseAddr = static_cast<int>(MOSF_TEMP_ADDR);
    index = baseAddr - frameId;

    halfMosfetData.id = index;
    halfMosfetData.isUpdated = 1;
    batProc.updateMosfetStatus(msg.data[0], halfMosfetData);
    halfMosfetData.temperature.top = batProc.getTemperature(msg,3, 1);
    halfMosfetData.temperature.mid = batProc.getTemperature(msg,4, 1);
    halfMosfetData.temperature.bot = batProc.getTemperature(msg,5, 1);
    halfMosfetData.temperature.cmosTemp = batProc.getTemperature(msg,6, 1);
    halfMosfetData.temperature.dmosTemp = batProc.getTemperature(msg,7, 1);
    packData.insert(halfMosfetData);

    // batteryData[index - 1].id = index;
    // batteryData[index - 1].isUpdated = 1;    
    // batProc.updateMosfetStatus(msg.data[0], batteryData[index-1]);
    // batteryData[index - 1].temperature.top = batProc.getTemperature(msg,3, 1);
    // batteryData[index - 1].temperature.mid = batProc.getTemperature(msg,4, 1);
    // batteryData[index - 1].temperature.bot = batProc.getTemperature(msg,5, 1);
    // batteryData[index - 1].temperature.cmosTemp = batProc.getTemperature(msg,6, 1);
    // batteryData[index - 1].temperature.dmosTemp = batProc.getTemperature(msg,7, 1);
    // batteryData[index - 1].incMosfetCounter();
    // Serial1.println("Id : " + String(index - 1));
    // Serial1.println("Mosfet Status : " + String(batteryData[index - 1].mosfetStatus.val));
    // Serial1.println("Temperature Top : " + String(batteryData[index - 1].temperature.top));
    // Serial1.println("Temperature Mid : " + String(batteryData[index - 1].temperature.mid));
    // Serial1.println("Temperature Bot : " + String(batteryData[index - 1].temperature.bot));
    // Serial1.println("Temperature Cmos : " + String(batteryData[index - 1].temperature.cmosTemp));
    // Serial1.println("Temperature Dmos : " + String(batteryData[index - 1].temperature.dmosTemp));
    // return;
    break;

  default:
    break;
  }
  // return;

  if (frameId == 0x1D41C8E6) //ehub write lvd low config
  {
    // Serial1.println("Write lvd low config");
    voltageAlarm.vsatLowVoltage = (msg.data[1] << 8) + msg.data[0];
    uint16_t temp;
    EEPROM.get(LVD_LOW_VSAT_ADDR, temp);
    if(temp != voltageAlarm.vsatLowVoltage)
    {
      Serial1.println("Write to EEPROM");
      EEPROM.put(LVD_LOW_VSAT_ADDR, voltageAlarm.vsatLowVoltage);
    }
    else
    {
      Serial1.println("Same data");
    }

    voltageAlarm.otherLowVoltage = (msg.data[3] << 8) + msg.data[2];
    EEPROM.get(LVD_LOW_OTHER_ADDR, temp);
    if(temp != voltageAlarm.otherLowVoltage)
    {
      Serial1.println("Write to EEPROM");
      EEPROM.put(LVD_LOW_OTHER_ADDR, voltageAlarm.otherLowVoltage);
    }
    else
    {
      Serial1.println("Same data");
    }

    voltageAlarm.btsLowVoltage = (msg.data[5] << 8) + msg.data[4];
    EEPROM.get(LVD_LOW_BTS_ADDR, temp);
    if(temp != voltageAlarm.btsLowVoltage)
    {
      Serial1.println("Write to EEPROM");
      EEPROM.put(LVD_LOW_BTS_ADDR, voltageAlarm.btsLowVoltage);
    }
    else
    {
      Serial1.println("Same data");
    }

