thomsardi/stm32-lvd/src/main.cpp
    // voltageAlarm.tolerance = (msg.data[7] << 8) + msg.data[6];
    // EEPROM.get(LVD_TOLERANCE_ADDR, temp);
    // if(temp != voltageAlarm.tolerance)
    // {
    //   Serial1.println("Write to EEPROM");
    //   EEPROM.put(LVD_TOLERANCE_ADDR, voltageAlarm.tolerance);
    // }
    // else
    // {
    //   Serial1.println("Same data");
    // }

    CAN_msg_t response;
    response.id = (frameId & 0x0000FFFF) + ((frameId & 0x00FF0000) << 8) + ((frameId & 0xFF000000) >> 8);
    Serial1.print("Response Id : ");
    Serial1.println(response.id, HEX);
    response.format = CAN_FORMAT::EXTENDED_FORMAT;
    response.type = CAN_FRAME::DATA_FRAME;
    response.len = msg.len;
    for (size_t i = 0; i < msg.len; i++)
    {
      response.data[i] = msg.data[i];
    }
    xQueueSend(canSenderTaskQueue, &response, 200);
  }

  if (frameId == 0x1D41C8E5) //ehub write lvd reconnect config
  {
    Serial1.println("Write lvd reconnect config");
    voltageAlarm.vsatReconnectVoltage = (msg.data[1] << 8) + msg.data[0];
    uint16_t temp;
    EEPROM.get(LVD_RECONNECT_VSAT_ADDR, temp);
    if(temp != voltageAlarm.vsatReconnectVoltage)
    {
      Serial1.println("Write to EEPROM");
      EEPROM.put(LVD_RECONNECT_VSAT_ADDR, voltageAlarm.vsatReconnectVoltage);
    }
    else
    {
      Serial1.println("Same data");
    }

    voltageAlarm.otherReconnectVoltage = (msg.data[3] << 8) + msg.data[2];
    EEPROM.get(LVD_RECONNECT_OTHER_ADDR, temp);
    if(temp != voltageAlarm.otherReconnectVoltage)
    {
      Serial1.println("Write to EEPROM");
      EEPROM.put(LVD_RECONNECT_OTHER_ADDR, voltageAlarm.otherReconnectVoltage);
    }
    else
    {
      Serial1.println("Same data");
    }

    voltageAlarm.btsReconnectVoltage = (msg.data[5] << 8) + msg.data[4];
    EEPROM.get(LVD_RECONNECT_BTS_ADDR, temp);
    if(temp != voltageAlarm.btsReconnectVoltage)
    {
      Serial1.println("Write to EEPROM");
      EEPROM.put(LVD_RECONNECT_BTS_ADDR, voltageAlarm.btsReconnectVoltage);
    }
    else
    {
      Serial1.println("Same data");
    }

    CAN_msg_t response;
    response.id = (frameId & 0x0000FFFF) + ((frameId & 0x00FF0000) << 8) + ((frameId & 0xFF000000) >> 8);
    Serial1.print("Response Id : ");
    Serial1.println(response.id, HEX);
    response.format = CAN_FORMAT::EXTENDED_FORMAT;
    response.type = CAN_FRAME::DATA_FRAME;
    response.len = msg.len;
    for (size_t i = 0; i < msg.len; i++)
    {
      response.data[i] = msg.data[i];
    }
    xQueueSend(canSenderTaskQueue, &response, 200);
  }

  if(frameId == 0x1D41C8E4) //ehub write system config
  {
    Serial1.println("Write system config");
    voltageAlarm.nominalBattery = (msg.data[1] << 8) + msg.data[0];
    uint16_t temp;
    EEPROM.get(NOMINAL_BAT_ADDR, temp);
    if(temp != voltageAlarm.nominalBattery)
    {
      Serial1.println("Write to EEPROM");
      EEPROM.put(NOMINAL_BAT_ADDR, voltageAlarm.nominalBattery);
    }
    else
    {
      Serial1.println("Same data");
    }
    CAN_msg_t response;
    response.id = (frameId & 0x0000FFFF) + ((frameId & 0x00FF0000) << 8) + ((frameId & 0xFF000000) >> 8);
    Serial1.print("Response Id : ");
    Serial1.println(response.id, HEX);
    response.format = CAN_FORMAT::EXTENDED_FORMAT;
    response.type = CAN_FRAME::DATA_FRAME;
    response.len = msg.len;
    for (size_t i = 0; i < msg.len; i++)
    {
      response.data[i] = msg.data[i];
    }
    xQueueSend(canSenderTaskQueue, &response, 200);
  }

  if(frameId == 0x1D41C8E8) //ehub keep alive & override
  {
    // Serial1.println("Keep alive");
    // uint16_t id = (msg.data[1] << 8) + msg.data[0];
    // keepAliveCounter.cnt = (frameId & 0xFFFF0000) + (msg.data[3] << 24) + (msg.data[2] << 16) + (msg.data[1] << 8) + msg.data[0];
    // if (id == uniqueId)
    // {
    keepAliveCounter.cnt++;
    lostConnectionCounter = 0;
    if(msg.data[2] > 0)
    {
      isOverriden = true;
    }
    else
    {
      isOverriden = false;
    }
    // }
  }

  if(frameId == 0x1D41C8E7) //ehub write relay
  {
    Serial1.println("Ehub relay write");
    switch (msg.data[0])
    {
    case 1:
      ehubRelay.other = 1;
      break;
    case 2:
      ehubRelay.other = 0;
      break;
    case 3:
      ehubRelay.bts = 1;
      break;
    case 4:
      ehubRelay.bts = 0;
      break;
    case 5:
      ehubRelay.vsat = 1;
      break;
    case 6:
      ehubRelay.vsat = 0;
      break;
    default:
      break;
    }
    // switch (msg.data[0])
    // {
    // case 1:
    //   ehubRelay.vsat = 1;
    //   break;
    // case 2:
    //   ehubRelay.vsat = 0;
    //   break;
    // case 3:
    //   ehubRelay.bts = 1;
    //   break;
    // case 4:
    //   ehubRelay.bts = 0;
    //   break;
    // case 5:
    //   ehubRelay.other = 1;
    //   break;
    // case 6:
    //   ehubRelay.other = 0;
    //   break;
    // default:
    //   break;
    // }
    CAN_msg_t response;
    response.id = (frameId & 0x0000FFFF) + ((frameId & 0x00FF0000) << 8) + ((frameId & 0xFF000000) >> 8);
    Serial1.print("Response Id : ");
    Serial1.println(response.id, HEX);
    response.format = CAN_FORMAT::EXTENDED_FORMAT;
    response.type = CAN_FRAME::DATA_FRAME;
    response.len = msg.len;
    for (size_t i = 0; i < msg.len; i++)
    {
      response.data[i] = msg.data[i];
    }
    xQueueSend(canSenderTaskQueue, &response, 200);
  }  
}

int myFunction(int, int);

void vsatON()
{
  // digitalWrite(ON1, HIGH);
  digitalWrite(VSAT_ON, HIGH);
  vTaskDelay(200);
  digitalWrite(VSAT_ON, LOW);
  // digitalWrite(ON1, LOW);
  
}

void vsatOFF()
{
  // digitalWrite(OFF1, HIGH);
  digitalWrite(VSAT_OFF, HIGH);
  vTaskDelay(200);
  digitalWrite(VSAT_OFF, LOW);
  // digitalWrite(OFF1, LOW);
}

void btsON()
{
  // digitalWrite(ON2, HIGH);
  digitalWrite(BTS_ON, HIGH);
  vTaskDelay(200);
  digitalWrite(BTS_ON, LOW);
  // digitalWrite(ON2, LOW);
}

void btsOFF()
{
  // digitalWrite(OFF2, HIGH);
  digitalWrite(BTS_OFF, HIGH);
  vTaskDelay(200);
  digitalWrite(BTS_OFF, LOW);
  // digitalWrite(OFF2, LOW);
}

