thomsardi/stm32-lvd/src/main.cpp
      if (otherOn) //if other relay should be on
      {
        
        if(!additionalCanData.relayState.other) //if feedback still off, re-trigger relay
        // if(!otherOnSimState) //if feedback still off, re-trigger relay
        {
          Serial1.println("===Other On===");  
          otherOnSimState = true;
          ehubRelay.other = true;
          otherON();
        }
      }
      else //if other relay should be off
      {
         if(additionalCanData.relayState.other) //if feedback still on, re-trigger relay
        // if(otherOnSimState) //if feedback still on, re-trigger relay
        {
          Serial1.println("===Other Off===");  
          otherOnSimState = false;
          ehubRelay.other = false;
          otherOFF();
        }
        if(averageVoltage >= voltageAlarm.getOtherUpperThreshold())
        // if(averageVoltage >= voltageAlarm.otherReconnectVoltage)
        {
          otherOn = true;
        }
      }
    }
    else
    {
      Serial1.println("Overriden");
      if(ehubRelay.vsat)  // if ehub activate vsat relay
      {
        if(!additionalCanData.relayState.vsat) //if feedback still off, re-trigger relay
        // if(!vsatOnSimState)
        {
          Serial1.println("Vsat On with override");
          vsatOnSimState = true;
          ehubRelay.vsat = true;
          vsatON();
        }
      }
      else  //if ehub deactivate vsat relay
      {
        if(additionalCanData.relayState.vsat) //if feedback still on, re-trigger relay
        // if(vsatOnSimState)
        {
          Serial1.println("Vsat off with override");
          vsatOnSimState = false;
          ehubRelay.vsat = false;
          vsatOFF();
        }  
      }

      if (ehubRelay.bts)  // if ehub activate bts relay
      {
        if(!additionalCanData.relayState.bts) //if feedback still off, re-trigger relay
        // if(!btsOnSimState)
        {
          Serial1.println("Bts on with override");
          btsOnSimState = true;
          ehubRelay.bts = true;
          btsON();
        }
      }
      else  //if ehub deactivate bts relay
      {
        if(additionalCanData.relayState.bts)  //if feedback still on, re-trigger relay
        // if(btsOnSimState)
        {
          Serial1.println("Bts off with override");
          btsOnSimState = false;
          ehubRelay.bts = false;
          btsOFF();
        }
      }
      
      if (ehubRelay.other) // if ehub activate other relay
      {
        if(!additionalCanData.relayState.other) //if feedback still off, re-trigger relay
        // if(!otherOnSimState)
        {
          Serial1.println("Other on with override");
          otherOnSimState = true;
          ehubRelay.other = true;
          otherON();
        }
      }
      else  //if ehub deactivate other relay
      {
        if(additionalCanData.relayState.other)  //if feedback still on, re-trigger relay
        // if(otherOnSimState)
        {
          Serial1.println("Other off with override");
          otherOnSimState = false;
          ehubRelay.other = false;
          otherOFF();
        }
      }
    }
    timeToShow++;
    vTaskDelay(200);
  }
}


static void canSenderTask(void *arg)
{
  bool isOff = true;
  CAN_msg_t msg;
  int idInc = 0;
  int paramId = 1;
  // int totalId = sizeof(batteryData) / sizeof(batteryData[0]);
  // Serial.println("Total size = " + String(totalId));
  while(1)
  {
    if (xQueueReceive(canSenderTaskQueue, &msg, 100) == pdTRUE) 
    {
      can.send(&msg);
      vTaskDelay(20);
      // Serial1.println("Send CAN current & relay");
    }
    else
    {
      // msg to keep the battery awake
      CAN_msg_t txBuff;
      // if(idInc >= packData.stack.size())
      // {
      //   idInc = 0;
      // }

      if (idInc < packData.stack.size())
      {
        BatteryData temp = packData.getData(idInc);
        txBuff.id = WAKE_ADDR + (temp.id << 8);
        txBuff.format = CAN_FORMAT::EXTENDED_FORMAT;
        txBuff.type = CAN_FRAME::DATA_FRAME;
        txBuff.len = 8;
        txBuff.data[0] = 0x33;
        txBuff.data[1] = 0x63;
        txBuff.data[2] = 0x60;
        txBuff.data[3] = 0x64;
        txBuff.data[4] = 0x64;
        txBuff.data[5] = 0x64;
        txBuff.data[6] = 0x53;
        txBuff.data[7] = 0x64;
        can.send(&txBuff);
        idInc++;
      }
      else
      {
        switch (paramId)
        {
        case 1:
          txBuff.id = PeriodicAddress::LOW_VOLTAGE_PARAM_ADDR;
          txBuff.format = CAN_FORMAT::EXTENDED_FORMAT;
          txBuff.type = CAN_FRAME::DATA_FRAME;
          txBuff.len = 8;
          txBuff.data[0] = voltageAlarm.vsatLowVoltage & 0xFF;
          txBuff.data[1] = voltageAlarm.vsatLowVoltage >> 8;
          txBuff.data[2] = voltageAlarm.otherLowVoltage & 0xFF;
          txBuff.data[3] = voltageAlarm.otherLowVoltage >> 8;
          txBuff.data[4] = voltageAlarm.btsLowVoltage & 0xFF;
          txBuff.data[5] = voltageAlarm.btsLowVoltage >> 8;
          txBuff.data[6] = 0x01;
          txBuff.data[7] = 0x01;
          can.send(&txBuff);
          paramId++;
          break;
        case 2:
          txBuff.id = PeriodicAddress::RECONNECT_VOLTAGE_PARAM_ADDR;
          txBuff.format = CAN_FORMAT::EXTENDED_FORMAT;
          txBuff.type = CAN_FRAME::DATA_FRAME;
          txBuff.len = 8;
          txBuff.data[0] = voltageAlarm.vsatReconnectVoltage & 0xFF;
          txBuff.data[1] = voltageAlarm.vsatReconnectVoltage >> 8;
          txBuff.data[2] = voltageAlarm.otherReconnectVoltage & 0xFF;
          txBuff.data[3] = voltageAlarm.otherReconnectVoltage >> 8;
          txBuff.data[4] = voltageAlarm.btsReconnectVoltage & 0xFF;
          txBuff.data[5] = voltageAlarm.btsReconnectVoltage >> 8;
          txBuff.data[6] = 0x01;
          txBuff.data[7] = 0x01;
          can.send(&txBuff);
          paramId = 1;
          idInc = 0;
          break;
        
        default:
          break;
        }
      }

      
      // for (size_t i = 1; i <= 24; i++)
      // {
      //   /* code */
      //   CAN_msg_t msg;
      //   msg.id = WAKE_ADDR + (i << 8);
      //   msg.format = CAN_FORMAT::EXTENDED_FORMAT;
      //   msg.type = CAN_FRAME::DATA_FRAME;
      //   msg.len = 8;
      //   msg.data[0] = 0x33;
      //   msg.data[1] = 0x63;
      //   msg.data[2] = 0x60;
      //   msg.data[3] = 0x64;
      //   msg.data[4] = 0x64;
      //   msg.data[5] = 0x64;
      //   msg.data[6] = 0x53;
      //   msg.data[7] = 0x64;
      //   can.send(&msg);
      //   // vTaskDelay(20);
      // }
      
        
      // Serial1.println("Send CAN to wake up battery");
      // Serial1.print("Frame id : ");
      // Serial1.println(msg.id, HEX);
      // Serial1.print("Data : ");
      // for (size_t i = 0; i < 8; i++)
      // {
      //   Serial1.print(msg.data[i], HEX);
      //   Serial1.print(" ");
      // }
      // Serial.println();
      // idInc++;
      vTaskDelay(200);
    }
    // vTaskDelay(1000);
  }
}

void ina3221Task()
{
  int limitUnderAmpere = 0.2;
  
